#ifndef GAMETEXTUREMANAGER_H
#define GAMETEXTUREMANAGER_H

//-----------------------------------------------------------------------------------------------
//              ゲームで使うTextureを管理するクラス
// 
// pngデータからスライスした画像を保管する。
// mapで管理し、Keyとしてはtypes.hのenum class TextureTypeを使っている
//-----------------------------------------------------------------------------------------------

#include "GameTexture.h"
#include <map>
#include "types.h"

class GameTextureManager {
public:  
    //=======================================================================================
    //                          コンストラクタ
    //=======================================================================================
    GameTextureManager() {}

    //=======================================================================================
    //pngデータとサイズなどの情報を受けとり、画像をスライスしてメンバ変数に格納する
    //=======================================================================================
    bool TextureInport(TextureType type,UseTextureDataConfig config);

    //=======================================================================================
    // 任意の GameTexture を描画する共通関数
    //=======================================================================================
    std::shared_ptr<GameTexture> GetTexture(TextureType type);

    //===============================================================================================
   //画像のロード
   //===============================================================================================
    bool TextureLoad(TextureType type, UseTextureDataConfig config);

    //===============================================================================================
    // 指定したインデックスの画像を描画
    //===============================================================================================
    void TextureDraw(TextureType type,int index, int x, int y) ;


    //=======================================================================================
    //                          デストラクタ
    //=======================================================================================
    ~GameTextureManager() {}

private: 
    std::map<TextureType, std::shared_ptr<GameTexture>> textures_;      // TextureType をキーにして GameTexture を管理するマップ


};

#endif


